In [1]:
import pandas as pd
import numpy as np

In [5]:
## Load CSV
url = "https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"
countries = pd.read_csv(url)

In [7]:
## Basic Info
countries.info()
countries.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
Name        5 non-null object
People      5 non-null int64
Area        5 non-null int64
BIP         5 non-null int64
Currency    5 non-null object
dtypes: int64(3), object(2)
memory usage: 272.0+ bytes

             People          Area         BIP
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

In [8]:
## Display the last 4 rows
countries[-4:]

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [9]:
## Countries with Euro
countries[countries['Currency'] == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [11]:
## Only name and currency
nc = countries[['Name', 'Currency']]
nc

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [17]:
## Only countries with more than 2000 BIP
nb = countries[['Name', 'BIP']]
nb[countries['BIP'] > 2000]

      Name   BIP
0  Germany  3466
1    Japan  4938

In [18]:
## Inhabitants between 50 and 150 Mio
npeo = countries[['Name', 'People']]
npeo[(countries['People'] >= 50000000) & (countries['People'] <= 150000000)]

      Name     People
0  Germany   82521653
1    Japan  126045000
3    Italy   60501718

In [19]:
## Rename BIP to Bip
countries.rename(columns={"BIP": "Bip"})

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [21]:
## Bip sum
countries['BIP'].sum()

13581

In [22]:
## Average people
countries['People'].mean()

102786293.6

In [23]:
## Alphabetical sort
countries.sort_values('Name')

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [25]:
## New Data Frame with BIG and SMALL
countries_alt = countries.copy()
    
countries_alt['Area'] = np.select([ countries_alt['Area'] > 1000000, (countries_alt['Area'] <= 1000000)], ['BIG', 'SMALL'])
countries_alt

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL